Tekla Open API Reference for Tekla Structures 2025
Events.DocumentManagerClosed Event
 The DocumentManagerClosed eventis raised when the document manager is closed.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.DocumentManagerClosedDelegate DocumentManagerClosed
Public Event DocumentManagerClosed As Events.DocumentManagerClosedDelegate
Value
Type: Tekla.Structures.Drawing.UI.Events.DocumentManagerClosedDelegate
Implements
IUIEvents.DocumentManagerClosed
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace